Tekla Open API Reference for Tekla Structures 2025
ModelInfo.SharedModel Property
 The read-only property of the Tekla Structures model's sharing status.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SharedModel { get; }
Public ReadOnly Property SharedModel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace